src/Catalogs/ГруппыПользователейЦентрМониторинга/ГруппыПользователейЦентрМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователейЦентрМониторинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>РуководительГруппы</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчастникиГруппы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВСпискеВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Скайп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляРегистрацииОшибок</name>
    <comment>Идентификатор пользователя во внешней системе для регистрации ошибок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestApiМетод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestApiАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Выбрана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ГруппыПользователейЦентрМониторинга/Forms/ФормаСозданияИДобавленияПользователя/Module.bsl
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Группа = Параметры.Группа;
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = Логин;
	Пользователь.ПоказыватьВСпискеВыбора = Истина;
	
	СтрокаРоли = Пользователь.Роли.Добавить();
	СтрокаРоли.Выбрана = Истина;
	СтрокаРоли.Роль = "ЦентрМониторингаПользователь";
	СтрокаРоли.СинонимРоли = Метаданные.Роли.ЦентрМониторингаПользователь.Синоним;
	
	Пользователь.ДополнительныеСвойства.Вставить("СохраняемыйПарольПользователя", Пароль);
	
	Пользователь.Записать();
	
	ГруппаОбъект = Группа.ПолучитьОбъект();
	СтрокаУчастника = ГруппаОбъект.УчастникиГруппы.Добавить();
	СтрокаУчастника.Пользователь = Пользователь.Ссылка;
	ГруппаОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Пароль = ПодтверждениеПароля Тогда 
		ОКНаСервере();
		Закрыть();
	Иначе 
		Сообщить("Пароль и подтверждение не совпадают!");
		Пароль = "";
		ПодтверждениеПароля = "";
	КонецЕсли;
КонецПроцедуры
